In [1]:
from IPython.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'key': ['a','b','c','f'], 
                    'c1':[1,2,3,5]})

In [4]:
df2 = pd.DataFrame({'key': ['a','b','d','f'],
                    'c2':[5,6,7,8]})

In [5]:
df1.merge(df2)

  key  c1  c2
0   a   1   5
1   b   2   6
2   f   5   8

In [6]:
df1.merge(df2, how='left')

  key  c1   c2
0   a   1  5.0
1   b   2  6.0
2   c   3  NaN
3   f   5  8.0

In [7]:
df1.merge(df2, how='right')

  key   c1  c2
0   a  1.0   5
1   b  2.0   6
2   d  NaN   7
3   f  5.0   8

In [8]:
df1.merge(df2, how="outer")

  key   c1   c2
0   a  1.0  5.0
1   b  2.0  6.0
2   c  3.0  NaN
3   f  5.0  8.0
4   d  NaN  7.0

In [9]:
df1

  key  c1
0   a   1
1   b   2
2   c   3
3   f   5

In [10]:
df2

  key  c2
0   a   5
1   b   6
2   d   7
3   f   8

In [11]:
df3 = pd.DataFrame({'key3': ['a','b','c','f'],
                    'c1':[1,2,3,5]})

In [12]:
df4 = pd.DataFrame({'key4': ['a','b','d','f'],
                    'c2':[5,6,7,8]})

In [13]:
df3

  key3  c1
0    a   1
1    b   2
2    c   3
3    f   5

In [14]:
df4

  key4  c2
0    a   5
1    b   6
2    d   7
3    f   8

In [15]:
# df3.merge(df4) # df3과 df4에 같은 열이 없으므로 에러

In [16]:
df3.merge(df4, left_on='key3', right_on='key4')

  key3  c1 key4  c2
0    a   1    a   5
1    b   2    b   6
2    f   5    f   8

In [17]:
df3.merge(df4, left_index=True, right_index=True)

  key3  c1 key4  c2
0    a   1    a   5
1    b   2    b   6
2    c   3    d   7
3    f   5    f   8

In [18]:
df1 = pd.DataFrame({'c1': [1,2,3,4], 'c2': [5,6,7,8]})

In [19]:
df2 = pd.DataFrame({'c3': ['a','b','c','d'],
                    'c4': [1.2,3.4,5.5,7.6]})

In [20]:
pd.concat([df1,df2], axis=1)

   c1  c2 c3   c4
0   1   5  a  1.2
1   2   6  b  3.4
2   3   7  c  5.5
3   4   8  d  7.6

In [21]:
pd.concat([df1,df2], axis=0)

    c1   c2   c3   c4
0  1.0  5.0  NaN  NaN
1  2.0  6.0  NaN  NaN
2  3.0  7.0  NaN  NaN
3  4.0  8.0  NaN  NaN
0  NaN  NaN    a  1.2
1  NaN  NaN    b  3.4
2  NaN  NaN    c  5.5
3  NaN  NaN    d  7.6

In [22]:
df1 = pd.DataFrame({'c1': [1,2,3,4], 
                    'c2': [5,6,7,8]},
                   index=[0,2,4,6])

In [23]:
df2 = pd.DataFrame({'c3': ['a','b','c','d'],
                    'c4': [1.2,3.4,5.5,7.6]},
                   index=[0,1,2,3])

In [24]:
df1

   c1  c2
0   1   5
2   2   6
4   3   7
6   4   8

In [25]:
df2

  c3   c4
0  a  1.2
1  b  3.4
2  c  5.5
3  d  7.6

In [26]:
pd.concat([df1, df2], axis=1)

    c1   c2   c3   c4
0  1.0  5.0    a  1.2
2  2.0  6.0    c  5.5
4  3.0  7.0  NaN  NaN
6  4.0  8.0  NaN  NaN
1  NaN  NaN    b  3.4
3  NaN  NaN    d  7.6

In [27]:
df1.reset_index()

   index  c1  c2
0      0   1   5
1      2   2   6
2      4   3   7
3      6   4   8

In [28]:
df1.reset_index(drop=True)

   c1  c2
0   1   5
1   2   6
2   3   7
3   4   8

In [29]:
df1.reset_index(drop=True, inplace=True)

In [30]:
df1

   c1  c2
0   1   5
1   2   6
2   3   7
3   4   8

In [31]:
df2

  c3   c4
0  a  1.2
1  b  3.4
2  c  5.5
3  d  7.6

In [32]:
pd.concat([df1,df2], axis=1)

   c1  c2 c3   c4
0   1   5  a  1.2
1   2   6  b  3.4
2   3   7  c  5.5
3   4   8  d  7.6